#include <linux/types.h>
#include <mach/mt_pm_ldo.h>
#include <cust_alsps.h>
#include <mach/upmu_common.h>

static struct alsps_hw cust_alsps_hw = {
    .i2c_num    = 0,
	.polling_mode_ps =0,
	.polling_mode_als =1,
    .power_id   = MT65XX_POWER_NONE,    /*LDO is not used*/
    .power_vol  = VOL_DEFAULT,          /*LDO is not used*/
    //.i2c_addr   = {0x0C, 0x48, 0x78, 0x00},
    //.als_level  = { 0,  1,  1,   7,  15,  15,  100, 1000, 2000,  3000,  6000, 10000, 14000, 18000, 20000},
    //.als_value  = {40, 40, 90,  90, 160, 160,  225,  320,  640,  1280,  1280,  2600,  2600, 2600,  10240, 10240},
    /* MTK: modified to support AAL */
   //.als_level  = { 10,  32,  64,  96,  128,  256,  384,   640,  896,   1284,   1652,  2164,   2676,   3410,  4200,  5224},
  //.als_value  = { 0, 20, 40, 80, 140, 225, 320,  640,  1280,  1280,  2600, 2600,  6000, 9000,  9999, 10240},
    // .als_level  = {20, 44, 88,  137, 243, 630, 708, 1780, 2246, 2713, 3672,5406,5406,5406,5406,5406},
   //  .als_value  = {20, 40, 80, 140, 225, 320, 640, 1280, 2600, 6000, 9999, 10240,10240,10240,10240,10240},
// 苏 勇 2014年01月08日 10:25:28       .als_level  = { 10,  32,  64,  96,  128,  256,  384,   640,  896,   1284,   1652,  2164,   2676,   3410,  4200,  5224},
// 苏 勇 2014年01月08日 10:25:28      .als_value= {0, 80, 140, 320, 640, 2600, 5007, 8006, 10010, 12010, 16010, 20010,20010,20010,20010,20010},
// 苏 勇 2014年01月08日 11:38:13     .als_level  = {0,20, 40, 62,  137,600, 1150,6500},
// 苏 勇 2014年01月08日 11:38:13     .als_value  = {0,0, 20, 80, 400, 450, 800,1300},

	 .als_level  = {0,3, 9, 22,  40, 70, 140,280,   560,650,1900,5800, 10240,10241},
     .als_value  = {0,18,60,100, 220,230,250,300,   500,560,1200,2600, 10240,10240},
// 苏 勇 2014年01月08日 15:46:03	 .als_level  = {0,8,12,20,30,45,50,140,300,530,740,1600,2000,2240,3830},
// 苏 勇 2014年01月08日 15:46:03     .als_value  = {0,4,8,12,18,100,120,200,280,400,560,1000,1400,1600,2000},
    .ps_threshold_high = 500,
    .ps_threshold_low = 400,
  
};
struct alsps_hw *TMD2772_get_cust_alsps_hw(void) {
    return &cust_alsps_hw;
}

int TMD2772_CMM_PPCOUNT_VALUE = 0x0d;
int TMD2772_ZOOM_TIME = 60;
int TMD2772_CMM_CONTROL_VALUE = 0x22;
//add by sen.luo 0xA0=25MA,0x20=100MA,0xE0=12.5MA,0x60=50ma

